In [13]:
from pandas import DataFrame
df=DataFrame(
                [
                    ["aryan","singh","fulltime","administration",2,20000],
                    ["rohan","agarwal","intern","technical",1,5000],
                    ["riya","shah","fulltime","administration",5,10000],
                    ["yash","bhatiya","parttime","technical",3,10000],
                    ["siddhant","khanna","fulltime","management",6,20000]
                ]
                ,columns=["first Name","last name","type","department","YoE","Salary"]
            )
df

  first Name last name      type      department  YoE  Salary
0      aryan     singh  fulltime  administration    2   20000
1      rohan   agarwal    intern       technical    1    5000
2       riya      shah  fulltime  administration    5   10000
3       yash   bhatiya  parttime       technical    3   10000
4   siddhant    khanna  fulltime      management    6   20000

 Make a pivot table which shows average salary of each type of employee for each
department.

In [14]:
import pandas as pd
table=pd.pivot_table(df,index='type',columns='department',values='Salary')
table

department  administration  management  technical
type
fulltime           15000.0     20000.0        NaN
intern                 NaN         NaN     5000.0
parttime               NaN         NaN    10000.0

Make a pivot table which shows the sum and mean of the salaries of each type of
employee and the number of employees of each type

In [16]:
table=pd.pivot_table(df,index='type',values='Salary',aggfunc=['sum','mean'])
table

            sum          mean
         Salary        Salary
type
fulltime  50000  16666.666667
intern     5000   5000.000000
parttime  10000  10000.000000

In [22]:
table=pd.pivot_table(df,index='type',values='Salary',aggfunc=['sum','mean','count'])
table

            sum          mean  count
         Salary        Salary Salary
type
fulltime  50000  16666.666667      3
intern     5000   5000.000000      1
parttime  10000  10000.000000      1